{
  "title": "UJR Technologies",
  "image": "/projects/sk/UJR_logo.jpeg",
  "live": "",
  "role": "Software Engineer",
  "agency": "Contract",
  "completed": "01.2025",
  "awards": ["Backend Programming", "UI Design", "Database Optimization"],
  "modules": [
    {
      "component": "TextIntro",
      "text": "UJR Technologies. is a global company specializing in software products and technology. UJR offers customized software products and IT services.It cutting- edge solutions that deliver competitive advantage to our valued clients. "},
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/Ujrhero.jpeg",
          "alt": "Rexel_logo"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "The challenge",
      "text": " We provide cutting- edge solutions that deliver competitive advantage to our valued clients. Our disciplined management techniques, domain knowledge and holistic approach constantly develop ways to enhance value to our clients. Focus on quality at every step coupled with skilled resource management ensures that development remains always on track.",
      "numbers": [
        {
          "value": 1,
          "label": "Awards"
        },
        {
          "value": 11,
          "label": "Months of work"
        },
        {
          "value": "5",
          "label": "People in the team"
        }
      ]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/hero.jpeg",
          "alt": "AQuest v1"
        }
        
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "The attention to detail",
      "text": "All pages of the site had to have the same attention to detail, no matter how much they would be visited.<br /><br />Here in the cases, for example, to listen to the audio that characterizes an experience, we made components that simulate strings. Page 404 contains the game Pong, and as you navigate the pages, the texts tilt according to the speed of your scroll."
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/sketchin-form-1.jpeg",
          "alt": "AQuest v1"
        }
      ]
    },
    
    {
      "component": "TextTwoColumns",
      "title": "Not only creativity",
      "text": "This project not only meant creativity from a visual point of view, but it was also an opportunity to experiment with new development tools.<br /><br />The entire frontend codebase is in fact written in Flow, which in 2023 aimed to make javascript and in particular React (Flow itself being developed by Facebook) a typed language.<br /><br />To handle asynchronous events (data requests, animations, audio effects, transitions, etc.) we embraced the reactive paradigm making heavy use of RX.js",
      "technologies": ["React", "Java","SpringBoot","SQL","Kafka","AZure","Javascript"]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/sketchin-form-2.jpeg",
          "alt": "AQuest site"
        }
      ]
    },
    {
      "component": "Awards",
      "awards": ["FWA", "Awwwards", "CSS Design Award", "Digital Design Awards"]
    }
  ]
}
